#include "config.h"

#include <string.h>

#include "uiobj.h"
#include "comp.h"
#include "game_types.h" /* only for UIOBJ_MAX */
#include "hw.h"
#include "kbd.h"
#include "lbxfont.h"
#include "lbxgfx.h"
#include "log.h"
#include "mouse.h"
#include "types.h"
#include "uicursor.h"
#include "uidefs.h"
#include "uidelay.h"
#include "uidraw.h"
#include "uihelp.h"
#include "uipal.h"

/* -------------------------------------------------------------------------- */

/*
    WASBUG? MOO1 allocs 0x1650 bytes fitting 150 which is not always enough.
    Absolute max is planets + orbits + fleets + transports + some buttons.
    This is overkill for actual gameplay but we are not limited by 1993 memory sizes.
*/
#define UIOBJ_MAX   (PLANETS_MAX * 7 + FLEET_ENROUTE_MAX + TRANSPORT_MAX + 32)

#define UIOBJ_OFFSCREEN (320 * UI_SCALE_MAX + 100)

typedef struct uiobj_s {
    /*00*/ uint16_t x0;
    /*02*/ uint16_t y0;
    /*04*/ uint16_t x1;    /* inclusive */
    /*06*/ uint16_t y1;    /* inclusive */
    /* 13 types
        t0..3: buttons with gfx (and optional text) with different highlight conditions
        t1: toggle
        t2: set1
        t3: setval
        t4: textinput
        t6: slider
        t7: mousearea or inputkey
        t8: altstr
        ta: text line
        tb: scroll area
        tc: mouse wheel area
    */
    /*08*/ uint8_t type;
    /*..*/ uint8_t scale;
    /*1a*/ int16_t *vptr;
    /*24*/ uint32_t key;
    union {
        struct {
            /*16*/ const char *str;
            /*20*/ uint8_t *lbxdata;
            /*18*/ int16_t z18; /* t3:uiobji? */
            /*0c*/ uint8_t fontnum; /* t1..3? */
            /*0e*/ uint8_t fonta2; /* t1..3? */
            /*1c*/ bool indep;  /* from lbxgfx offs 0x10 */
        } t0; /* t{0..3} */
        struct {
            /*16*/ char *buf;
            /*22*/ const uint8_t *colortbl;
            /*20*/ uint16_t buflen;
            /*0c*/ uint8_t fontnum;
            /*0e*/ uint8_t fonta2;
            /*14*/ uint8_t fonta4;
            /*1a*/ uint8_t rectcolor;
            /*1c*/ bool align_right;
            /*..*/ bool allow_lcase;
        } t4;
        struct {
            /*..*/ void (*cb)(void *ctx, uint8_t slideri, int16_t value);
            /*..*/ void *ctx;
            /*1c*/ uint16_t vmin;
            /*1e*/ uint16_t vmax;
            /*..*/ uint8_t slideri;
        } t6;
        struct {
            /*16*/ const char *str;
            /*18*/ uint16_t pos;
            /*1a*/ uint16_t len;
        } t8;
        struct {
            /*16*/ const char *str;
            /*18*/ int16_t z18;
            /*0c*/ uint8_t fontnum;
            /*0e*/ uint8_t fonta2;
            /*14*/ uint8_t fonta2b;
            /*10*/ uint8_t subtype; /* 0, 1, 0xf */
            /*1c*/ uint8_t sp0v;
            /*12*/ bool z12;
        } ta;
        struct {
            /*1c*/ int16_t *xptr;
            /*1e*/ int16_t *yptr;
            /*..*/ uint8_t *zptr;
            /*18*/ uint16_t xdiv;
            /*1a*/ uint16_t ydiv;
            /*..*/ uint8_t zmax;
        } tb;
    };
} uiobj_t;

/* -------------------------------------------------------------------------- */

static uint16_t uiobj_table_num = 0;
static uint16_t uiobj_table_num_old = 0;
static int16_t uiobj_focus_oi = -1;
static int16_t uiobj_clicked_oi = 0;
static int uiobj_xoff = 1;
static int uiobj_yoff = -1;
static int16_t uiobj_mouseoff = 0;
static int16_t uiobj_handle_downcount = 0;
static int16_t uiobj_kbd_alt_oi = 0;
static uint16_t uiobj_delay = 2;
static int16_t uiobj_help_id = -1;
static bool uiobj_flag_select_list_active = false;
static bool uiobj_flag_select_list_multipage = false;
static int16_t uiobj_kbd_movey = -1;
static bool uiobj_flag_skip_delay = false;

static bool uiobj_flag_have_cb = false;
static void (*uiobj_callback)(void *) = NULL;
static void *uiobj_cbdata = NULL;

static uiobj_t uiobj_tbl[UIOBJ_MAX];

/* -------------------------------------------------------------------------- */

