#include "config.h"

#include <string.h>

#include "uiobj.h"
#include "comp.h"
#include "game.h"   /* only for UIOBJ_MAX */
#include "hw.h"
#include "kbd.h"
#include "lbxfont.h"
#include "lbxgfx.h"
#include "log.h"
#include "mouse.h"
#include "types.h"
#include "uicursor.h"
#include "uidefs.h"
#include "uidelay.h"
#include "uidraw.h"
#include "uihelp.h"
#include "uipal.h"

/* -------------------------------------------------------------------------- */

/*
    WASBUG? MOO1 allocs 0x1650 bytes fitting 150 which is not always enough.
    Absolute max is planets + orbits + fleets + transports + some buttons.
    This is overkill for actual gameplay but we are not limited by 1993 memory sizes.
*/
#define UIOBJ_MAX   (PLANETS_MAX * 7 + FLEET_ENROUTE_MAX + TRANSPORT_MAX + 32)

#define UIOBJ_OFFSCREEN (((UI_SCREEN_W > UI_SCREEN_H) ? UI_SCREEN_W : UI_SCREEN_H) + 100)

typedef struct uiobj_s {
    /*00*/ uint16_t x0;
    /*02*/ uint16_t y0;
    /*04*/ uint16_t x1;    /* inclusive */
    /*06*/ uint16_t y1;    /* inclusive */
    /* 12 types
        t0..3: buttons with gfx (and optional text) with different highlight conditions
        t1: toggle
        t2: set1
        t3: setval
        t4: textinput
        t6: slider
        t7: mousearea or inputkey
        t8: altstr
        ta: text line
        tb: scroll area
    */
    /*08*/ uint16_t type;
    /*0a*/ int16_t helpid;
    /*1a*/ int16_t *vptr;
    /*24*/ uint32_t key;
    union {
        struct {
            /*0c*/ uint16_t fontnum; /* t1..3? */
            /*0e*/ uint16_t fonta2; /* t1..3? */
            /*16*/ const char *str;
            /*18*/ int16_t z18; /* t3:uiobji? */
            /*1c*/ bool indep;  /* from lbxgfx offs 0x10 */
            /*20*/ uint8_t *lbxdata;
        } t0; /* t{0..3} */
        struct {
            /*0c*/ uint16_t fontnum;
            /*0e*/ uint16_t fonta2;
            /*14*/ uint16_t fonta4;
            /*16*/ char *buf;
            /*1a*/ uint8_t rectcolor;
            /*1c*/ bool align_right;
            /*1e*/ uint16_t z1e;    /* bool? */
            /*20*/ uint16_t buflen;
            /*22*/ const uint8_t *colortbl;
        } t4;
        struct {
            /*16*/ uint16_t fmin;
            /*18*/ uint16_t fmax;
            /*1c*/ uint16_t vmin;
            /*1e*/ uint16_t vmax;
            /*20*/ bool vertical;
        } t6;
        struct {
            /*16*/ const char *str;
            /*18*/ uint16_t pos;
            /*1a*/ uint16_t len;
        } t8;
        struct {
            /*16*/ uint16_t uiobji;
            /*18*/ int16_t z18;
        } t9;
        struct {
            /*0c*/ uint16_t fontnum;
            /*0e*/ uint16_t fonta2;
            /*10*/ uint16_t subtype;
            /*12*/ bool z12;
            /*14*/ uint16_t fonta2b;
            /*16*/ const char *str;
            /*18*/ int16_t z18;
            /*1c..22 are subtype specific parameters */
            /*1c: used as offs and value, determined by "z < 0x100"! adding extra var here for sanity */
            /*1c*/ uint8_t *sp0p;
            /*1c*/ uint16_t sp0v;
            /*1e*/ uint16_t sp1;
            /*20*/ uint16_t sp2;
            /*22*/ uint16_t sp3;
        } ta;
        struct {
            /*18*/ uint16_t xdiv;
            /*1a*/ uint16_t ydiv;
            /*1c*/ uint16_t *xptr;
            /*1e*/ uint16_t *yptr;
        } tb;
    };
} uiobj_t;

/* -------------------------------------------------------------------------- */

static uint16_t uiobj_table_num = 0;
static uint16_t uiobj_table_num_old = 0;
static int16_t uiobj_hmm1_oi = -1;
static int16_t uiobj_hmm2_oi = 0;
static int uiobj_hmm3_xoff = 1;
static int uiobj_hmm3_yoff = -1;
static uint16_t uiobj_hmm3_fonta4 = 0;
static int16_t uiobj_mouseoff = 0;
static int16_t uiobj_handle_downcount = 0;
static uint16_t uiobj_kbd_hmm1 = 0;
static uint16_t uiobj_hmm5_delay = 2;
static uint16_t uiobj_hmm6 = 0;
static int16_t uiobj_help_id = -1;
static int16_t uiobj_hmm8 = 1;
static bool uiobj_hmm9 = false;
static int16_t uiobj_kbd_movey = -1;
static bool uiobj_flag_skip_delay = false;

static bool uiobj_flag_have_cb = false;
static void (*uiobj_callback)(void *) = NULL;
static void *uiobj_cbdata = NULL;

static uiobj_t uiobj_tbl[UIOBJ_MAX];

